      $set AdventOfCode
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HiSanta.

       PROCEDURE DIVISION.
         DISPLAY "Hello Santa"
      $DISPLAY "I was a bad bad boy"
       STOP RUN.
      * EOF
